# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'mas'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'composer'
brew 'imagemagick'
brew 'nginx'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'gpg-suite'
cask 'imageoptim'
cask 'slack'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'there'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'tweetbot'
cask 'docker'
cask 'zoom'
cask 'android-studio'
cask 'android-platform-tools'
cask 'istat-menus'
cask 'bartender'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'provisionql'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'GarageBand', id: 682658836 
mas 'Playgrounds', id: 1496833156 
mas 'SQLPro for SQLite', id: 586001240
mas 'PiPifier', id: 1160374471
mas 'Pastebot', id: 1179623856
mas 'Moom', id: 419330170
mas 'Soulver', id: 413965349
mas 'Pages', id: 409201541
mas 'Day One', id: 1055511498
mas 'Resizer', id: 411277085
mas 'Kindle', id: 405399194
mas 'Space Gremlin', id: 414515628
mas 'Microsoft Outlook', id: 985367838
mas 'iMovie', id: 408981434
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694